raw/sysbench-PERF22_20-pareto-psmdb-3.2-ft-60000000-512-oltp_ro.txt
sysbench 0.9:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 512
Report intermediate results every 10 second(s)
Initializing random number generator from current time


setting write concern to 1
Threads started!

[  10s] threads: 512, tps: 0.70, reads: 2.80, writes: 0.00, response time: 246.00ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 512, tps: 1714.99, reads: 5155.48, writes: 0.00, response time: 94.82ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 512, tps: 0.00, reads: 0.00, writes: 0.00, response time: 0.00ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 512, tps: 8589.20, reads: 25763.60, writes: 0.00, response time: 97.49ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 512, tps: 11800.10, reads: 35398.80, writes: 0.00, response time: 97.26ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 512, tps: 11756.80, reads: 35272.39, writes: 0.00, response time: 97.58ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 512, tps: 12111.10, reads: 36341.30, writes: 0.00, response time: 94.82ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 512, tps: 12134.10, reads: 36397.90, writes: 0.00, response time: 94.56ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 512, tps: 12121.00, reads: 36363.99, writes: 0.00, response time: 94.45ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 512, tps: 12101.50, reads: 36307.31, writes: 0.00, response time: 94.62ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 512, tps: 12103.40, reads: 36309.50, writes: 0.00, response time: 94.73ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 512, tps: 12084.80, reads: 36255.20, writes: 0.00, response time: 94.79ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 512, tps: 11738.59, reads: 35207.88, writes: 0.00, response time: 97.76ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 512, tps: 11725.30, reads: 35176.60, writes: 0.00, response time: 97.73ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 512, tps: 11723.70, reads: 35171.31, writes: 0.00, response time: 97.70ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 512, tps: 11719.60, reads: 35156.40, writes: 0.00, response time: 97.61ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 512, tps: 11698.00, reads: 35096.51, writes: 0.00, response time: 97.90ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 512, tps: 11701.30, reads: 35103.19, writes: 0.00, response time: 97.93ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 512, tps: 12030.09, reads: 36097.38, writes: 0.00, response time: 95.19ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 512, tps: 12059.50, reads: 36179.31, writes: 0.00, response time: 95.10ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 512, tps: 12040.70, reads: 36120.31, writes: 0.00, response time: 95.16ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 512, tps: 12027.20, reads: 36082.79, writes: 0.00, response time: 95.36ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 512, tps: 12020.60, reads: 36059.91, writes: 0.00, response time: 95.47ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 512, tps: 12033.60, reads: 36102.81, writes: 0.00, response time: 95.16ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 512, tps: 11696.20, reads: 35082.29, writes: 0.00, response time: 98.02ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 512, tps: 11662.60, reads: 34986.61, writes: 0.00, response time: 98.17ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 512, tps: 11650.60, reads: 34954.09, writes: 0.00, response time: 98.34ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 512, tps: 11637.80, reads: 34911.91, writes: 0.00, response time: 98.52ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 512, tps: 11648.80, reads: 34944.90, writes: 0.00, response time: 98.31ms (95%), errors: 0.00, reconnects:  0.00
[ 300s] threads: 512, tps: 11661.20, reads: 34984.59, writes: 0.00, response time: 98.17ms (95%), errors: 0.00, reconnects:  0.00
[ 310s] threads: 512, tps: 12013.09, reads: 36043.18, writes: 0.00, response time: 95.16ms (95%), errors: 0.00, reconnects:  0.00
[ 320s] threads: 512, tps: 12024.90, reads: 36078.51, writes: 0.00, response time: 95.38ms (95%), errors: 0.00, reconnects:  0.00
[ 330s] threads: 512, tps: 12022.10, reads: 36065.41, writes: 0.00, response time: 95.33ms (95%), errors: 0.00, reconnects:  0.00
[ 340s] threads: 512, tps: 12030.39, reads: 36090.08, writes: 0.00, response time: 95.33ms (95%), errors: 0.00, reconnects:  0.00
[ 350s] threads: 512, tps: 12014.81, reads: 36046.03, writes: 0.00, response time: 95.38ms (95%), errors: 0.00, reconnects:  0.00
[ 360s] threads: 512, tps: 12017.38, reads: 36050.85, writes: 0.00, response time: 95.30ms (95%), errors: 0.00, reconnects:  0.00
[ 370s] threads: 512, tps: 11686.71, reads: 35054.74, writes: 0.00, response time: 98.08ms (95%), errors: 0.00, reconnects:  0.00
[ 380s] threads: 512, tps: 11659.79, reads: 34978.16, writes: 0.00, response time: 98.20ms (95%), errors: 0.00, reconnects:  0.00
[ 390s] threads: 512, tps: 11659.30, reads: 34980.21, writes: 0.00, response time: 98.25ms (95%), errors: 0.00, reconnects:  0.00
[ 400s] threads: 512, tps: 11645.41, reads: 34933.53, writes: 0.00, response time: 98.46ms (95%), errors: 0.00, reconnects:  0.00
[ 410s] threads: 512, tps: 11641.90, reads: 34926.10, writes: 0.00, response time: 98.34ms (95%), errors: 0.00, reconnects:  0.00
[ 420s] threads: 512, tps: 11638.60, reads: 34916.30, writes: 0.00, response time: 98.22ms (95%), errors: 0.00, reconnects:  0.00
[ 430s] threads: 512, tps: 11972.20, reads: 35926.39, writes: 0.00, response time: 95.76ms (95%), errors: 0.00, reconnects:  0.00
[ 440s] threads: 512, tps: 11999.10, reads: 35996.70, writes: 0.00, response time: 95.38ms (95%), errors: 0.00, reconnects:  0.00
[ 450s] threads: 512, tps: 11986.70, reads: 35954.99, writes: 0.00, response time: 95.64ms (95%), errors: 0.00, reconnects:  0.00
[ 460s] threads: 512, tps: 11977.11, reads: 35933.32, writes: 0.00, response time: 95.67ms (95%), errors: 0.00, reconnects:  0.00
[ 470s] threads: 512, tps: 11988.10, reads: 35964.60, writes: 0.00, response time: 95.38ms (95%), errors: 0.00, reconnects:  0.00
[ 480s] threads: 512, tps: 11986.90, reads: 35960.41, writes: 0.00, response time: 95.67ms (95%), errors: 0.00, reconnects:  0.00
[ 490s] threads: 512, tps: 11684.29, reads: 35045.68, writes: 0.00, response time: 98.02ms (95%), errors: 0.00, reconnects:  0.00
[ 500s] threads: 512, tps: 11655.80, reads: 34968.81, writes: 0.00, response time: 98.31ms (95%), errors: 0.00, reconnects:  0.00
[ 510s] threads: 512, tps: 11657.30, reads: 34971.20, writes: 0.00, response time: 98.37ms (95%), errors: 0.00, reconnects:  0.00
[ 520s] threads: 512, tps: 11647.50, reads: 34943.21, writes: 0.00, response time: 98.43ms (95%), errors: 0.00, reconnects:  0.00
[ 530s] threads: 512, tps: 11648.40, reads: 34944.10, writes: 0.00, response time: 98.28ms (95%), errors: 0.00, reconnects:  0.00
[ 540s] threads: 512, tps: 11660.70, reads: 34982.59, writes: 0.00, response time: 98.31ms (95%), errors: 0.00, reconnects:  0.00
[ 550s] threads: 512, tps: 11954.50, reads: 35869.61, writes: 0.00, response time: 95.70ms (95%), errors: 0.00, reconnects:  0.00
[ 560s] threads: 512, tps: 11974.39, reads: 35923.88, writes: 0.00, response time: 95.76ms (95%), errors: 0.00, reconnects:  0.00
[ 570s] threads: 512, tps: 11985.50, reads: 35955.01, writes: 0.00, response time: 95.64ms (95%), errors: 0.00, reconnects:  0.00
[ 580s] threads: 512, tps: 11978.00, reads: 35936.20, writes: 0.00, response time: 95.84ms (95%), errors: 0.00, reconnects:  0.00
[ 590s] threads: 512, tps: 11968.00, reads: 35903.40, writes: 0.00, response time: 95.67ms (95%), errors: 0.00, reconnects:  0.00
[ 600s] threads: 512, tps: 11980.40, reads: 35941.90, writes: 0.00, response time: 95.47ms (95%), errors: 0.00, reconnects:  0.00
[ 610s] threads: 512, tps: 11659.40, reads: 34969.00, writes: 0.00, response time: 98.28ms (95%), errors: 0.00, reconnects:  0.00
[ 620s] threads: 512, tps: 11656.20, reads: 34970.70, writes: 0.00, response time: 98.20ms (95%), errors: 0.00, reconnects:  0.00
[ 630s] threads: 512, tps: 11647.30, reads: 34941.81, writes: 0.00, response time: 98.28ms (95%), errors: 0.00, reconnects:  0.00
[ 640s] threads: 512, tps: 11639.69, reads: 34919.08, writes: 0.00, response time: 98.43ms (95%), errors: 0.00, reconnects:  0.00
[ 650s] threads: 512, tps: 11626.00, reads: 34878.61, writes: 0.00, response time: 98.49ms (95%), errors: 0.00, reconnects:  0.00
[ 660s] threads: 512, tps: 11632.00, reads: 34896.30, writes: 0.00, response time: 98.31ms (95%), errors: 0.00, reconnects:  0.00
[ 670s] threads: 512, tps: 11968.70, reads: 35912.11, writes: 0.00, response time: 95.73ms (95%), errors: 0.00, reconnects:  0.00
[ 680s] threads: 512, tps: 11986.10, reads: 35959.50, writes: 0.00, response time: 95.56ms (95%), errors: 0.00, reconnects:  0.00
[ 690s] threads: 512, tps: 11983.90, reads: 35948.60, writes: 0.00, response time: 95.73ms (95%), errors: 0.00, reconnects:  0.00
[ 700s] threads: 512, tps: 11972.90, reads: 35919.60, writes: 0.00, response time: 95.84ms (95%), errors: 0.00, reconnects:  0.00
[ 710s] threads: 512, tps: 11976.40, reads: 35930.60, writes: 0.00, response time: 95.73ms (95%), errors: 0.00, reconnects:  0.00
[ 720s] threads: 512, tps: 11981.20, reads: 35943.29, writes: 0.00, response time: 95.50ms (95%), errors: 0.00, reconnects:  0.00
[ 730s] threads: 512, tps: 11652.00, reads: 34947.89, writes: 0.00, response time: 98.46ms (95%), errors: 0.00, reconnects:  0.00
[ 740s] threads: 512, tps: 11635.71, reads: 34909.62, writes: 0.00, response time: 98.37ms (95%), errors: 0.00, reconnects:  0.00
[ 750s] threads: 512, tps: 11644.20, reads: 34930.10, writes: 0.00, response time: 98.40ms (95%), errors: 0.00, reconnects:  0.00
[ 760s] threads: 512, tps: 11602.30, reads: 34808.69, writes: 0.00, response time: 98.55ms (95%), errors: 0.00, reconnects:  0.00
[ 770s] threads: 512, tps: 11595.70, reads: 34786.50, writes: 0.00, response time: 98.73ms (95%), errors: 0.00, reconnects:  0.00
[ 780s] threads: 512, tps: 11613.90, reads: 34840.41, writes: 0.00, response time: 98.61ms (95%), errors: 0.00, reconnects:  0.00
[ 790s] threads: 512, tps: 11921.10, reads: 35772.00, writes: 0.00, response time: 96.02ms (95%), errors: 0.00, reconnects:  0.00
[ 800s] threads: 512, tps: 11949.20, reads: 35848.50, writes: 0.00, response time: 95.90ms (95%), errors: 0.00, reconnects:  0.00
[ 810s] threads: 512, tps: 11965.30, reads: 35895.60, writes: 0.00, response time: 95.64ms (95%), errors: 0.00, reconnects:  0.00
[ 820s] threads: 512, tps: 11939.59, reads: 35820.16, writes: 0.00, response time: 96.07ms (95%), errors: 0.00, reconnects:  0.00
[ 830s] threads: 512, tps: 11941.41, reads: 35820.93, writes: 0.00, response time: 95.79ms (95%), errors: 0.00, reconnects:  0.00
[ 840s] threads: 512, tps: 11947.00, reads: 35843.70, writes: 0.00, response time: 95.76ms (95%), errors: 0.00, reconnects:  0.00
[ 850s] threads: 512, tps: 11620.20, reads: 34851.70, writes: 0.00, response time: 98.64ms (95%), errors: 0.00, reconnects:  0.00
[ 860s] threads: 512, tps: 11609.10, reads: 34828.10, writes: 0.00, response time: 98.58ms (95%), errors: 0.00, reconnects:  0.00
[ 870s] threads: 512, tps: 11608.70, reads: 34825.59, writes: 0.00, response time: 98.73ms (95%), errors: 0.00, reconnects:  0.00
[ 880s] threads: 512, tps: 11484.60, reads: 34454.20, writes: 0.00, response time: 99.91ms (95%), errors: 0.00, reconnects:  0.00
[ 890s] threads: 512, tps: 11481.60, reads: 34445.20, writes: 0.00, response time: 99.80ms (95%), errors: 0.00, reconnects:  0.00
[ 900s] threads: 512, tps: 11610.59, reads: 34831.78, writes: 0.00, response time: 98.58ms (95%), errors: 0.00, reconnects:  0.00
[ 910s] threads: 512, tps: 11922.91, reads: 35776.92, writes: 0.00, response time: 96.02ms (95%), errors: 0.00, reconnects:  0.00
[ 920s] threads: 512, tps: 11951.20, reads: 35848.30, writes: 0.00, response time: 95.84ms (95%), errors: 0.00, reconnects:  0.00
[ 930s] threads: 512, tps: 11954.60, reads: 35868.81, writes: 0.00, response time: 95.76ms (95%), errors: 0.00, reconnects:  0.00
[ 940s] threads: 512, tps: 11966.90, reads: 35898.10, writes: 0.00, response time: 95.59ms (95%), errors: 0.00, reconnects:  0.00
[ 950s] threads: 512, tps: 11954.29, reads: 35862.78, writes: 0.00, response time: 95.84ms (95%), errors: 0.00, reconnects:  0.00
[ 960s] threads: 512, tps: 11926.11, reads: 35779.12, writes: 0.00, response time: 96.04ms (95%), errors: 0.00, reconnects:  0.00
[ 970s] threads: 512, tps: 11633.90, reads: 34894.21, writes: 0.00, response time: 98.52ms (95%), errors: 0.00, reconnects:  0.00
[ 980s] threads: 512, tps: 11613.50, reads: 34840.89, writes: 0.00, response time: 98.58ms (95%), errors: 0.00, reconnects:  0.00
[ 990s] threads: 512, tps: 11597.07, reads: 34791.42, writes: 0.00, response time: 98.70ms (95%), errors: 0.00, reconnects:  0.00
[1000s] threads: 512, tps: 11604.21, reads: 34811.34, writes: 0.00, response time: 98.73ms (95%), errors: 0.00, reconnects:  0.00
[1010s] threads: 512, tps: 11588.71, reads: 34765.94, writes: 0.00, response time: 98.84ms (95%), errors: 0.00, reconnects:  0.00
[1020s] threads: 512, tps: 11598.50, reads: 34798.10, writes: 0.00, response time: 98.70ms (95%), errors: 0.00, reconnects:  0.00
[1030s] threads: 512, tps: 11913.40, reads: 35746.60, writes: 0.00, response time: 96.13ms (95%), errors: 0.00, reconnects:  0.00
[1040s] threads: 512, tps: 11938.90, reads: 35813.49, writes: 0.00, response time: 95.99ms (95%), errors: 0.00, reconnects:  0.00
[1050s] threads: 512, tps: 11966.60, reads: 35899.10, writes: 0.00, response time: 95.64ms (95%), errors: 0.00, reconnects:  0.00
[1060s] threads: 512, tps: 11935.70, reads: 35813.20, writes: 0.00, response time: 95.84ms (95%), errors: 0.00, reconnects:  0.00
[1070s] threads: 512, tps: 11965.40, reads: 35890.60, writes: 0.00, response time: 95.61ms (95%), errors: 0.00, reconnects:  0.00
[1080s] threads: 512, tps: 11948.10, reads: 35848.09, writes: 0.00, response time: 95.81ms (95%), errors: 0.00, reconnects:  0.00
[1090s] threads: 512, tps: 11642.60, reads: 34920.91, writes: 0.00, response time: 98.43ms (95%), errors: 0.00, reconnects:  0.00
[1100s] threads: 512, tps: 11592.49, reads: 34775.38, writes: 0.00, response time: 98.81ms (95%), errors: 0.00, reconnects:  0.00
[1110s] threads: 512, tps: 11593.41, reads: 34781.63, writes: 0.00, response time: 98.76ms (95%), errors: 0.00, reconnects:  0.00
[1120s] threads: 512, tps: 11589.00, reads: 34768.20, writes: 0.00, response time: 98.84ms (95%), errors: 0.00, reconnects:  0.00
[1130s] threads: 512, tps: 11587.30, reads: 34759.69, writes: 0.00, response time: 98.76ms (95%), errors: 0.00, reconnects:  0.00
[1140s] threads: 512, tps: 11589.50, reads: 34769.21, writes: 0.00, response time: 98.87ms (95%), errors: 0.00, reconnects:  0.00
[1150s] threads: 512, tps: 11896.70, reads: 35696.60, writes: 0.00, response time: 96.27ms (95%), errors: 0.00, reconnects:  0.00
[1160s] threads: 512, tps: 11942.29, reads: 35829.78, writes: 0.00, response time: 95.96ms (95%), errors: 0.00, reconnects:  0.00
[1170s] threads: 512, tps: 11932.21, reads: 35793.62, writes: 0.00, response time: 96.02ms (95%), errors: 0.00, reconnects:  0.00
[1180s] threads: 512, tps: 11918.60, reads: 35757.70, writes: 0.00, response time: 96.07ms (95%), errors: 0.00, reconnects:  0.00
[1190s] threads: 512, tps: 11923.60, reads: 35772.60, writes: 0.00, response time: 96.02ms (95%), errors: 0.00, reconnects:  0.00
[1200s] threads: 512, tps: 11905.60, reads: 35713.70, writes: 0.00, response time: 96.16ms (95%), errors: 0.00, reconnects:  0.00
[1210s] threads: 512, tps: 11602.20, reads: 34798.80, writes: 0.00, response time: 98.81ms (95%), errors: 0.00, reconnects:  0.00
[1220s] threads: 512, tps: 11565.00, reads: 34695.80, writes: 0.00, response time: 98.93ms (95%), errors: 0.00, reconnects:  0.00
[1230s] threads: 512, tps: 11581.39, reads: 34743.58, writes: 0.00, response time: 98.81ms (95%), errors: 0.00, reconnects:  0.00
[1240s] threads: 512, tps: 11591.41, reads: 34774.92, writes: 0.00, response time: 98.70ms (95%), errors: 0.00, reconnects:  0.00
[1250s] threads: 512, tps: 11599.90, reads: 34800.40, writes: 0.00, response time: 98.70ms (95%), errors: 0.00, reconnects:  0.00
[1260s] threads: 512, tps: 11576.69, reads: 34728.48, writes: 0.00, response time: 98.93ms (95%), errors: 0.00, reconnects:  0.00
[1270s] threads: 512, tps: 11894.50, reads: 35690.61, writes: 0.00, response time: 96.22ms (95%), errors: 0.00, reconnects:  0.00
[1280s] threads: 512, tps: 11933.70, reads: 35801.50, writes: 0.00, response time: 95.93ms (95%), errors: 0.00, reconnects:  0.00
[1290s] threads: 512, tps: 11938.50, reads: 35817.60, writes: 0.00, response time: 95.90ms (95%), errors: 0.00, reconnects:  0.00
[1300s] threads: 512, tps: 11922.40, reads: 35767.69, writes: 0.00, response time: 96.02ms (95%), errors: 0.00, reconnects:  0.00
[1310s] threads: 512, tps: 11913.90, reads: 35739.11, writes: 0.00, response time: 96.25ms (95%), errors: 0.00, reconnects:  0.00
[1320s] threads: 512, tps: 11944.89, reads: 35835.08, writes: 0.00, response time: 95.90ms (95%), errors: 0.00, reconnects:  0.00
[1330s] threads: 512, tps: 11620.61, reads: 34854.53, writes: 0.00, response time: 98.67ms (95%), errors: 0.00, reconnects:  0.00
[1340s] threads: 512, tps: 11577.80, reads: 34735.20, writes: 0.00, response time: 98.87ms (95%), errors: 0.00, reconnects:  0.00
[1350s] threads: 512, tps: 11578.00, reads: 34732.50, writes: 0.00, response time: 98.90ms (95%), errors: 0.00, reconnects:  0.00
[1360s] threads: 512, tps: 11596.50, reads: 34790.10, writes: 0.00, response time: 98.70ms (95%), errors: 0.00, reconnects:  0.00
[1370s] threads: 512, tps: 11583.40, reads: 34749.79, writes: 0.00, response time: 98.96ms (95%), errors: 0.00, reconnects:  0.00
[1380s] threads: 512, tps: 11589.70, reads: 34767.31, writes: 0.00, response time: 98.78ms (95%), errors: 0.00, reconnects:  0.00
[1390s] threads: 512, tps: 11908.30, reads: 35731.31, writes: 0.00, response time: 95.93ms (95%), errors: 0.00, reconnects:  0.00
[1400s] threads: 512, tps: 11957.30, reads: 35871.80, writes: 0.00, response time: 95.79ms (95%), errors: 0.00, reconnects:  0.00
[1410s] threads: 512, tps: 11940.10, reads: 35821.19, writes: 0.00, response time: 95.79ms (95%), errors: 0.00, reconnects:  0.00
[1420s] threads: 512, tps: 11927.20, reads: 35782.51, writes: 0.00, response time: 96.10ms (95%), errors: 0.00, reconnects:  0.00
[1430s] threads: 512, tps: 11955.30, reads: 35866.00, writes: 0.00, response time: 95.64ms (95%), errors: 0.00, reconnects:  0.00
[1440s] threads: 512, tps: 11912.18, reads: 35737.25, writes: 0.00, response time: 96.22ms (95%), errors: 0.00, reconnects:  0.00
[1450s] threads: 512, tps: 11601.52, reads: 34798.25, writes: 0.00, response time: 98.76ms (95%), errors: 0.00, reconnects:  0.00
[1460s] threads: 512, tps: 11577.50, reads: 34730.90, writes: 0.00, response time: 98.87ms (95%), errors: 0.00, reconnects:  0.00
[1470s] threads: 512, tps: 11570.30, reads: 34710.39, writes: 0.00, response time: 99.02ms (95%), errors: 0.00, reconnects:  0.00
[1480s] threads: 512, tps: 11571.80, reads: 34715.11, writes: 0.00, response time: 98.87ms (95%), errors: 0.00, reconnects:  0.00
[1490s] threads: 512, tps: 11578.10, reads: 34736.10, writes: 0.00, response time: 98.84ms (95%), errors: 0.00, reconnects:  0.00
[1500s] threads: 512, tps: 11566.60, reads: 34698.10, writes: 0.00, response time: 98.96ms (95%), errors: 0.00, reconnects:  0.00
[1510s] threads: 512, tps: 11889.80, reads: 35675.99, writes: 0.00, response time: 96.13ms (95%), errors: 0.00, reconnects:  0.00
[1520s] threads: 512, tps: 11921.09, reads: 35764.18, writes: 0.00, response time: 95.99ms (95%), errors: 0.00, reconnects:  0.00
[1530s] threads: 512, tps: 11935.51, reads: 35806.23, writes: 0.00, response time: 95.96ms (95%), errors: 0.00, reconnects:  0.00
[1540s] threads: 512, tps: 11944.00, reads: 35835.01, writes: 0.00, response time: 95.84ms (95%), errors: 0.00, reconnects:  0.00
[1550s] threads: 512, tps: 11937.50, reads: 35810.59, writes: 0.00, response time: 95.96ms (95%), errors: 0.00, reconnects:  0.00
[1560s] threads: 512, tps: 11934.20, reads: 35802.41, writes: 0.00, response time: 95.96ms (95%), errors: 0.00, reconnects:  0.00
[1570s] threads: 512, tps: 11615.70, reads: 34840.10, writes: 0.00, response time: 98.58ms (95%), errors: 0.00, reconnects:  0.00
[1580s] threads: 512, tps: 11561.50, reads: 34683.60, writes: 0.00, response time: 99.05ms (95%), errors: 0.00, reconnects:  0.00
[1590s] threads: 512, tps: 11565.19, reads: 34696.18, writes: 0.00, response time: 98.90ms (95%), errors: 0.00, reconnects:  0.00
[1600s] threads: 512, tps: 11566.81, reads: 34700.12, writes: 0.00, response time: 99.05ms (95%), errors: 0.00, reconnects:  0.00
[1610s] threads: 512, tps: 11556.80, reads: 34671.29, writes: 0.00, response time: 98.99ms (95%), errors: 0.00, reconnects:  0.00
[1620s] threads: 512, tps: 11560.71, reads: 34680.52, writes: 0.00, response time: 99.14ms (95%), errors: 0.00, reconnects:  0.00
[1630s] threads: 512, tps: 11844.70, reads: 35542.30, writes: 0.00, response time: 96.62ms (95%), errors: 0.00, reconnects:  0.00
[1640s] threads: 512, tps: 11882.60, reads: 35649.39, writes: 0.00, response time: 96.33ms (95%), errors: 0.00, reconnects:  0.00
[1650s] threads: 512, tps: 11892.60, reads: 35676.30, writes: 0.00, response time: 96.19ms (95%), errors: 0.00, reconnects:  0.00
[1660s] threads: 512, tps: 11870.30, reads: 35610.71, writes: 0.00, response time: 96.65ms (95%), errors: 0.00, reconnects:  0.00
[1670s] threads: 512, tps: 11888.80, reads: 35665.99, writes: 0.00, response time: 96.27ms (95%), errors: 0.00, reconnects:  0.00
[1680s] threads: 512, tps: 11881.00, reads: 35642.91, writes: 0.00, response time: 96.42ms (95%), errors: 0.00, reconnects:  0.00
[1690s] threads: 512, tps: 11589.80, reads: 34764.10, writes: 0.00, response time: 98.84ms (95%), errors: 0.00, reconnects:  0.00
[1700s] threads: 512, tps: 11563.90, reads: 34692.30, writes: 0.00, response time: 99.02ms (95%), errors: 0.00, reconnects:  0.00
[1710s] threads: 512, tps: 11570.50, reads: 34709.19, writes: 0.00, response time: 98.99ms (95%), errors: 0.00, reconnects:  0.00
[1720s] threads: 512, tps: 11586.80, reads: 34760.71, writes: 0.00, response time: 98.81ms (95%), errors: 0.00, reconnects:  0.00
[1730s] threads: 512, tps: 11567.50, reads: 34702.10, writes: 0.00, response time: 98.96ms (95%), errors: 0.00, reconnects:  0.00
[1740s] threads: 512, tps: 11578.60, reads: 34735.10, writes: 0.00, response time: 98.96ms (95%), errors: 0.00, reconnects:  0.00
[1750s] threads: 512, tps: 11856.59, reads: 35577.98, writes: 0.00, response time: 96.33ms (95%), errors: 0.00, reconnects:  0.00
[1760s] threads: 512, tps: 11913.40, reads: 35740.01, writes: 0.00, response time: 96.02ms (95%), errors: 0.00, reconnects:  0.00
[1770s] threads: 512, tps: 11904.80, reads: 35715.30, writes: 0.00, response time: 96.16ms (95%), errors: 0.00, reconnects:  0.00
[1780s] threads: 512, tps: 11809.79, reads: 35427.78, writes: 0.00, response time: 97.08ms (95%), errors: 0.00, reconnects:  0.00
[1790s] threads: 512, tps: 11876.91, reads: 35632.82, writes: 0.00, response time: 96.36ms (95%), errors: 0.00, reconnects:  0.00
[1800s] threads: 512, tps: 11898.80, reads: 35695.11, writes: 0.00, response time: 96.25ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            62582751
        write:                           0
        other:                           20860917
        total:                           83443668
    transactions:                        20860917 (11589.18 per sec.)
    read/write requests:                 62582751 (34767.53 per sec.)
    other operations:                    20860917 (11589.18 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          1800.0345s
    total number of events:              20860917
    total time taken by event execution: 921588.5252s
    response time:
         min:                                  1.92ms
         avg:                                 44.18ms
         max:                              19977.54ms
         approx.  95 percentile:              97.38ms

Threads fairness:
    events (avg/stddev):           40743.9785/107.23
    execution time (avg/stddev):   1799.9776/0.01